mychan-backend/app/controllers/comments_controller.rb

    def index
        comments = Post.find_by_id(params[:post_id]).comments
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def show
        comment = Comment.find_by_id(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        post = Post.find_by(id: params[:post_id])
        comment = post.comments.build(comment_params)
        post.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "te"], ["post_id", 22], ["created_at", "2020-10-22 01:16:42.328582"], ["updated_at", "2020-10-22 01:16:42.328582"]]