mychan-backend/app/controllers/posts_controller.rb

    def show
        post = Post.find_by_id(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        post = Post.create(post_params)
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "ggg"], ["content", "ggg"], ["created_at", "2020-10-05 20:55:09.235202"], ["updated_at", "2020-10-05 20:55:09.235202"]]